ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32F1xx/stm32f105xc.h
/******************  Bit definition for CAN_FFA1R register  *******************/
#define CAN_FFA1R_FFA_Pos                    (0U)                              
#define CAN_FFA1R_FFA_Msk                    (0x3FFFU << CAN_FFA1R_FFA_Pos)    /*!< 0x00003FFF */
#define CAN_FFA1R_FFA                        CAN_FFA1R_FFA_Msk                 /*!< Filter FIFO Assignment */
#define CAN_FFA1R_FFA0_Pos                   (0U)                              
#define CAN_FFA1R_FFA0_Msk                   (0x1U << CAN_FFA1R_FFA0_Pos)      /*!< 0x00000001 */
#define CAN_FFA1R_FFA0                       CAN_FFA1R_FFA0_Msk                /*!< Filter FIFO Assignment for filter 0 */
#define CAN_FFA1R_FFA1_Pos                   (1U)                              
#define CAN_FFA1R_FFA1_Msk                   (0x1U << CAN_FFA1R_FFA1_Pos)      /*!< 0x00000002 */
#define CAN_FFA1R_FFA1                       CAN_FFA1R_FFA1_Msk                /*!< Filter FIFO Assignment for filter 1 */
#define CAN_FFA1R_FFA2_Pos                   (2U)                              
#define CAN_FFA1R_FFA2_Msk                   (0x1U << CAN_FFA1R_FFA2_Pos)      /*!< 0x00000004 */
#define CAN_FFA1R_FFA2                       CAN_FFA1R_FFA2_Msk                /*!< Filter FIFO Assignment for filter 2 */
#define CAN_FFA1R_FFA3_Pos                   (3U)                              
#define CAN_FFA1R_FFA3_Msk                   (0x1U << CAN_FFA1R_FFA3_Pos)      /*!< 0x00000008 */
#define CAN_FFA1R_FFA3                       CAN_FFA1R_FFA3_Msk                /*!< Filter FIFO Assignment for filter 3 */
#define CAN_FFA1R_FFA4_Pos                   (4U)                              
#define CAN_FFA1R_FFA4_Msk                   (0x1U << CAN_FFA1R_FFA4_Pos)      /*!< 0x00000010 */
#define CAN_FFA1R_FFA4                       CAN_FFA1R_FFA4_Msk                /*!< Filter FIFO Assignment for filter 4 */
#define CAN_FFA1R_FFA5_Pos                   (5U)                              
#define CAN_FFA1R_FFA5_Msk                   (0x1U << CAN_FFA1R_FFA5_Pos)      /*!< 0x00000020 */
#define CAN_FFA1R_FFA5                       CAN_FFA1R_FFA5_Msk                /*!< Filter FIFO Assignment for filter 5 */
#define CAN_FFA1R_FFA6_Pos                   (6U)                              
#define CAN_FFA1R_FFA6_Msk                   (0x1U << CAN_FFA1R_FFA6_Pos)      /*!< 0x00000040 */
#define CAN_FFA1R_FFA6                       CAN_FFA1R_FFA6_Msk                /*!< Filter FIFO Assignment for filter 6 */
#define CAN_FFA1R_FFA7_Pos                   (7U)                              
#define CAN_FFA1R_FFA7_Msk                   (0x1U << CAN_FFA1R_FFA7_Pos)      /*!< 0x00000080 */
#define CAN_FFA1R_FFA7                       CAN_FFA1R_FFA7_Msk                /*!< Filter FIFO Assignment for filter 7 */
#define CAN_FFA1R_FFA8_Pos                   (8U)                              
#define CAN_FFA1R_FFA8_Msk                   (0x1U << CAN_FFA1R_FFA8_Pos)      /*!< 0x00000100 */
#define CAN_FFA1R_FFA8                       CAN_FFA1R_FFA8_Msk                /*!< Filter FIFO Assignment for filter 8 */
#define CAN_FFA1R_FFA9_Pos                   (9U)                              
#define CAN_FFA1R_FFA9_Msk                   (0x1U << CAN_FFA1R_FFA9_Pos)      /*!< 0x00000200 */
#define CAN_FFA1R_FFA9                       CAN_FFA1R_FFA9_Msk                /*!< Filter FIFO Assignment for filter 9 */
#define CAN_FFA1R_FFA10_Pos                  (10U)                             
#define CAN_FFA1R_FFA10_Msk                  (0x1U << CAN_FFA1R_FFA10_Pos)     /*!< 0x00000400 */
#define CAN_FFA1R_FFA10                      CAN_FFA1R_FFA10_Msk               /*!< Filter FIFO Assignment for filter 10 */
#define CAN_FFA1R_FFA11_Pos                  (11U)                             
#define CAN_FFA1R_FFA11_Msk                  (0x1U << CAN_FFA1R_FFA11_Pos)     /*!< 0x00000800 */
#define CAN_FFA1R_FFA11                      CAN_FFA1R_FFA11_Msk               /*!< Filter FIFO Assignment for filter 11 */
#define CAN_FFA1R_FFA12_Pos                  (12U)                             
#define CAN_FFA1R_FFA12_Msk                  (0x1U << CAN_FFA1R_FFA12_Pos)     /*!< 0x00001000 */
#define CAN_FFA1R_FFA12                      CAN_FFA1R_FFA12_Msk               /*!< Filter FIFO Assignment for filter 12 */
#define CAN_FFA1R_FFA13_Pos                  (13U)                             
#define CAN_FFA1R_FFA13_Msk                  (0x1U << CAN_FFA1R_FFA13_Pos)     /*!< 0x00002000 */
#define CAN_FFA1R_FFA13                      CAN_FFA1R_FFA13_Msk               /*!< Filter FIFO Assignment for filter 13 */
#define CAN_FFA1_FFA14_Pos                   (14U)                             
#define CAN_FFA1_FFA14_Msk                   (0x1U << CAN_FFA1_FFA14_Pos)      /*!< 0x00004000 */
#define CAN_FFA1_FFA14                       CAN_FFA1_FFA14_Msk                /*!< Filter FIFO Assignment for filter 14 */
#define CAN_FFA1_FFA15_Pos                   (15U)                             
#define CAN_FFA1_FFA15_Msk                   (0x1U << CAN_FFA1_FFA15_Pos)      /*!< 0x00008000 */
#define CAN_FFA1_FFA15                       CAN_FFA1_FFA15_Msk                /*!< Filter FIFO Assignment for filter 15 */
#define CAN_FFA1_FFA16_Pos                   (16U)                             
#define CAN_FFA1_FFA16_Msk                   (0x1U << CAN_FFA1_FFA16_Pos)      /*!< 0x00010000 */
#define CAN_FFA1_FFA16                       CAN_FFA1_FFA16_Msk                /*!< Filter FIFO Assignment for filter 16 */
#define CAN_FFA1_FFA17_Pos                   (17U)                             
#define CAN_FFA1_FFA17_Msk                   (0x1U << CAN_FFA1_FFA17_Pos)      /*!< 0x00020000 */
#define CAN_FFA1_FFA17                       CAN_FFA1_FFA17_Msk                /*!< Filter FIFO Assignment for filter 17 */
#define CAN_FFA1_FFA18_Pos                   (18U)                             
#define CAN_FFA1_FFA18_Msk                   (0x1U << CAN_FFA1_FFA18_Pos)      /*!< 0x00040000 */
#define CAN_FFA1_FFA18                       CAN_FFA1_FFA18_Msk                /*!< Filter FIFO Assignment for filter 18 */
#define CAN_FFA1_FFA19_Pos                   (19U)                             
#define CAN_FFA1_FFA19_Msk                   (0x1U << CAN_FFA1_FFA19_Pos)      /*!< 0x00080000 */
#define CAN_FFA1_FFA19                       CAN_FFA1_FFA19_Msk                /*!< Filter FIFO Assignment for filter 19 */
#define CAN_FFA1_FFA20_Pos                   (20U)                             
#define CAN_FFA1_FFA20_Msk                   (0x1U << CAN_FFA1_FFA20_Pos)      /*!< 0x00100000 */
#define CAN_FFA1_FFA20                       CAN_FFA1_FFA20_Msk                /*!< Filter FIFO Assignment for filter 20 */
#define CAN_FFA1_FFA21_Pos                   (21U)                             
#define CAN_FFA1_FFA21_Msk                   (0x1U << CAN_FFA1_FFA21_Pos)      /*!< 0x00200000 */
#define CAN_FFA1_FFA21                       CAN_FFA1_FFA21_Msk                /*!< Filter FIFO Assignment for filter 21 */
#define CAN_FFA1_FFA22_Pos                   (22U)                             
#define CAN_FFA1_FFA22_Msk                   (0x1U << CAN_FFA1_FFA22_Pos)      /*!< 0x00400000 */
#define CAN_FFA1_FFA22                       CAN_FFA1_FFA22_Msk                /*!< Filter FIFO Assignment for filter 22 */
#define CAN_FFA1_FFA23_Pos                   (23U)                             
#define CAN_FFA1_FFA23_Msk                   (0x1U << CAN_FFA1_FFA23_Pos)      /*!< 0x00800000 */
#define CAN_FFA1_FFA23                       CAN_FFA1_FFA23_Msk                /*!< Filter FIFO Assignment for filter 23 */
#define CAN_FFA1_FFA24_Pos                   (24U)                             
#define CAN_FFA1_FFA24_Msk                   (0x1U << CAN_FFA1_FFA24_Pos)      /*!< 0x01000000 */
#define CAN_FFA1_FFA24                       CAN_FFA1_FFA24_Msk                /*!< Filter FIFO Assignment for filter 24 */
#define CAN_FFA1_FFA25_Pos                   (25U)                             
#define CAN_FFA1_FFA25_Msk                   (0x1U << CAN_FFA1_FFA25_Pos)      /*!< 0x02000000 */
#define CAN_FFA1_FFA25                       CAN_FFA1_FFA25_Msk                /*!< Filter FIFO Assignment for filter 25 */
#define CAN_FFA1_FFA26_Pos                   (26U)                             
#define CAN_FFA1_FFA26_Msk                   (0x1U << CAN_FFA1_FFA26_Pos)      /*!< 0x04000000 */
#define CAN_FFA1_FFA26                       CAN_FFA1_FFA26_Msk                /*!< Filter FIFO Assignment for filter 26 */
#define CAN_FFA1_FFA27_Pos                   (27U)                             
#define CAN_FFA1_FFA27_Msk                   (0x1U << CAN_FFA1_FFA27_Pos)      /*!< 0x08000000 */
#define CAN_FFA1_FFA27                       CAN_FFA1_FFA27_Msk                /*!< Filter FIFO Assignment for filter 27 */

/*******************  Bit definition for CAN_FA1R register  *******************/
#define CAN_FA1R_FACT_Pos                    (0U)                              
#define CAN_FA1R_FACT_Msk                    (0x3FFFU << CAN_FA1R_FACT_Pos)    /*!< 0x00003FFF */
#define CAN_FA1R_FACT                        CAN_FA1R_FACT_Msk                 /*!< Filter Active */
#define CAN_FA1R_FACT0_Pos                   (0U)                              
#define CAN_FA1R_FACT0_Msk                   (0x1U << CAN_FA1R_FACT0_Pos)      /*!< 0x00000001 */
#define CAN_FA1R_FACT0                       CAN_FA1R_FACT0_Msk                /*!< Filter 0 Active */
#define CAN_FA1R_FACT1_Pos                   (1U)                              
#define CAN_FA1R_FACT1_Msk                   (0x1U << CAN_FA1R_FACT1_Pos)      /*!< 0x00000002 */
#define CAN_FA1R_FACT1                       CAN_FA1R_FACT1_Msk                /*!< Filter 1 Active */
#define CAN_FA1R_FACT2_Pos                   (2U)                              
#define CAN_FA1R_FACT2_Msk                   (0x1U << CAN_FA1R_FACT2_Pos)      /*!< 0x00000004 */
#define CAN_FA1R_FACT2                       CAN_FA1R_FACT2_Msk                /*!< Filter 2 Active */
#define CAN_FA1R_FACT3_Pos                   (3U)                              
#define CAN_FA1R_FACT3_Msk                   (0x1U << CAN_FA1R_FACT3_Pos)      /*!< 0x00000008 */
#define CAN_FA1R_FACT3                       CAN_FA1R_FACT3_Msk                /*!< Filter 3 Active */
#define CAN_FA1R_FACT4_Pos                   (4U)                              
#define CAN_FA1R_FACT4_Msk                   (0x1U << CAN_FA1R_FACT4_Pos)      /*!< 0x00000010 */
#define CAN_FA1R_FACT4                       CAN_FA1R_FACT4_Msk                /*!< Filter 4 Active */
#define CAN_FA1R_FACT5_Pos                   (5U)                              
#define CAN_FA1R_FACT5_Msk                   (0x1U << CAN_FA1R_FACT5_Pos)      /*!< 0x00000020 */
#define CAN_FA1R_FACT5                       CAN_FA1R_FACT5_Msk                /*!< Filter 5 Active */
#define CAN_FA1R_FACT6_Pos                   (6U)                              
#define CAN_FA1R_FACT6_Msk                   (0x1U << CAN_FA1R_FACT6_Pos)      /*!< 0x00000040 */
#define CAN_FA1R_FACT6                       CAN_FA1R_FACT6_Msk                /*!< Filter 6 Active */
#define CAN_FA1R_FACT7_Pos                   (7U)                              
#define CAN_FA1R_FACT7_Msk                   (0x1U << CAN_FA1R_FACT7_Pos)      /*!< 0x00000080 */
#define CAN_FA1R_FACT7                       CAN_FA1R_FACT7_Msk                /*!< Filter 7 Active */
#define CAN_FA1R_FACT8_Pos                   (8U)                              
#define CAN_FA1R_FACT8_Msk                   (0x1U << CAN_FA1R_FACT8_Pos)      /*!< 0x00000100 */
#define CAN_FA1R_FACT8                       CAN_FA1R_FACT8_Msk                /*!< Filter 8 Active */
#define CAN_FA1R_FACT9_Pos                   (9U)                              
#define CAN_FA1R_FACT9_Msk                   (0x1U << CAN_FA1R_FACT9_Pos)      /*!< 0x00000200 */
#define CAN_FA1R_FACT9                       CAN_FA1R_FACT9_Msk                /*!< Filter 9 Active */
#define CAN_FA1R_FACT10_Pos                  (10U)                             
#define CAN_FA1R_FACT10_Msk                  (0x1U << CAN_FA1R_FACT10_Pos)     /*!< 0x00000400 */
#define CAN_FA1R_FACT10                      CAN_FA1R_FACT10_Msk               /*!< Filter 10 Active */
#define CAN_FA1R_FACT11_Pos                  (11U)                             
#define CAN_FA1R_FACT11_Msk                  (0x1U << CAN_FA1R_FACT11_Pos)     /*!< 0x00000800 */
#define CAN_FA1R_FACT11                      CAN_FA1R_FACT11_Msk               /*!< Filter 11 Active */
#define CAN_FA1R_FACT12_Pos                  (12U)                             
#define CAN_FA1R_FACT12_Msk                  (0x1U << CAN_FA1R_FACT12_Pos)     /*!< 0x00001000 */
#define CAN_FA1R_FACT12                      CAN_FA1R_FACT12_Msk               /*!< Filter 12 Active */
#define CAN_FA1R_FACT13_Pos                  (13U)                             
#define CAN_FA1R_FACT13_Msk                  (0x1U << CAN_FA1R_FACT13_Pos)     /*!< 0x00002000 */
#define CAN_FA1R_FACT13                      CAN_FA1R_FACT13_Msk               /*!< Filter 13 Active */
#define CAN_FA1R_FACT14_Pos                  (14U)                             
#define CAN_FA1R_FACT14_Msk                  (0x1U << CAN_FA1R_FACT14_Pos)     /*!< 0x00004000 */
#define CAN_FA1R_FACT14                      CAN_FA1R_FACT14_Msk               /*!< Filter 14 Active */
#define CAN_FA1R_FACT15_Pos                  (15U)                             
#define CAN_FA1R_FACT15_Msk                  (0x1U << CAN_FA1R_FACT15_Pos)     /*!< 0x00008000 */
#define CAN_FA1R_FACT15                      CAN_FA1R_FACT15_Msk               /*!< Filter 15 Active */
#define CAN_FA1R_FACT16_Pos                  (16U)                             
#define CAN_FA1R_FACT16_Msk                  (0x1U << CAN_FA1R_FACT16_Pos)     /*!< 0x00010000 */
#define CAN_FA1R_FACT16                      CAN_FA1R_FACT16_Msk               /*!< Filter 16 Active */
#define CAN_FA1R_FACT17_Pos                  (17U)                             
#define CAN_FA1R_FACT17_Msk                  (0x1U << CAN_FA1R_FACT17_Pos)     /*!< 0x00020000 */
#define CAN_FA1R_FACT17                      CAN_FA1R_FACT17_Msk               /*!< Filter 17 Active */
#define CAN_FA1R_FACT18_Pos                  (18U)                             
#define CAN_FA1R_FACT18_Msk                  (0x1U << CAN_FA1R_FACT18_Pos)     /*!< 0x00040000 */
#define CAN_FA1R_FACT18                      CAN_FA1R_FACT18_Msk               /*!< Filter 18 Active */
#define CAN_FA1R_FACT19_Pos                  (19U)                             
#define CAN_FA1R_FACT19_Msk                  (0x1U << CAN_FA1R_FACT19_Pos)     /*!< 0x00080000 */
#define CAN_FA1R_FACT19                      CAN_FA1R_FACT19_Msk               /*!< Filter 19 Active */
#define CAN_FA1R_FACT20_Pos                  (20U)                             
#define CAN_FA1R_FACT20_Msk                  (0x1U << CAN_FA1R_FACT20_Pos)     /*!< 0x00100000 */
#define CAN_FA1R_FACT20                      CAN_FA1R_FACT20_Msk               /*!< Filter 20 Active */
#define CAN_FA1R_FACT21_Pos                  (21U)                             
#define CAN_FA1R_FACT21_Msk                  (0x1U << CAN_FA1R_FACT21_Pos)     /*!< 0x00200000 */
#define CAN_FA1R_FACT21                      CAN_FA1R_FACT21_Msk               /*!< Filter 21 Active */
#define CAN_FA1R_FACT22_Pos                  (22U)                             
#define CAN_FA1R_FACT22_Msk                  (0x1U << CAN_FA1R_FACT22_Pos)     /*!< 0x00400000 */
#define CAN_FA1R_FACT22                      CAN_FA1R_FACT22_Msk               /*!< Filter 22 Active */
#define CAN_FA1R_FACT23_Pos                  (23U)                             
#define CAN_FA1R_FACT23_Msk                  (0x1U << CAN_FA1R_FACT23_Pos)     /*!< 0x00800000 */
#define CAN_FA1R_FACT23                      CAN_FA1R_FACT23_Msk               /*!< Filter 23 Active */
#define CAN_FA1R_FACT24_Pos                  (24U)                             
#define CAN_FA1R_FACT24_Msk                  (0x1U << CAN_FA1R_FACT24_Pos)     /*!< 0x01000000 */
#define CAN_FA1R_FACT24                      CAN_FA1R_FACT24_Msk               /*!< Filter 24 Active */
#define CAN_FA1R_FACT25_Pos                  (25U)                             
#define CAN_FA1R_FACT25_Msk                  (0x1U << CAN_FA1R_FACT25_Pos)     /*!< 0x02000000 */
#define CAN_FA1R_FACT25                      CAN_FA1R_FACT25_Msk               /*!< Filter 25 Active */
#define CAN_FA1R_FACT26_Pos                  (26U)                             
#define CAN_FA1R_FACT26_Msk                  (0x1U << CAN_FA1R_FACT26_Pos)     /*!< 0x04000000 */
#define CAN_FA1R_FACT26                      CAN_FA1R_FACT26_Msk               /*!< Filter 26 Active */
#define CAN_FA1R_FACT27_Pos                  (27U)                             
#define CAN_FA1R_FACT27_Msk                  (0x1U << CAN_FA1R_FACT27_Pos)     /*!< 0x08000000 */
#define CAN_FA1R_FACT27                      CAN_FA1R_FACT27_Msk               /*!< Filter 27 Active */

